espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/lp_i2s_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** LP_I2S_VAD_CONF_REG register
 *  I2S VAD Configure register
 */
#define LP_I2S_VAD_CONF_REG (DR_REG_LP_I2S_BASE + 0x0)
/** LP_I2S_VAD_EN : R/W; bitpos: [0]; default: 0;
 *  VAD enable register
 */
#define LP_I2S_VAD_EN    (BIT(0))
#define LP_I2S_VAD_EN_M  (LP_I2S_VAD_EN_V << LP_I2S_VAD_EN_S)
#define LP_I2S_VAD_EN_V  0x00000001U
#define LP_I2S_VAD_EN_S  0
/** LP_I2S_VAD_RESET : WT; bitpos: [1]; default: 0;
 *  VAD reset register
 */
#define LP_I2S_VAD_RESET    (BIT(1))
#define LP_I2S_VAD_RESET_M  (LP_I2S_VAD_RESET_V << LP_I2S_VAD_RESET_S)
#define LP_I2S_VAD_RESET_V  0x00000001U
#define LP_I2S_VAD_RESET_S  1
/** LP_I2S_VAD_FORCE_START : WT; bitpos: [2]; default: 0;
 *  VAD force start register.
 */
#define LP_I2S_VAD_FORCE_START    (BIT(2))
#define LP_I2S_VAD_FORCE_START_M  (LP_I2S_VAD_FORCE_START_V << LP_I2S_VAD_FORCE_START_S)
#define LP_I2S_VAD_FORCE_START_V  0x00000001U
#define LP_I2S_VAD_FORCE_START_S  2

/** LP_I2S_VAD_RESULT_REG register
 *  I2S VAD Result register
 */
#define LP_I2S_VAD_RESULT_REG (DR_REG_LP_I2S_BASE + 0x4)
/** LP_I2S_VAD_FLAG : RO; bitpos: [0]; default: 0;
 *  Reg vad flag observe signal
 */
#define LP_I2S_VAD_FLAG    (BIT(0))
#define LP_I2S_VAD_FLAG_M  (LP_I2S_VAD_FLAG_V << LP_I2S_VAD_FLAG_S)
#define LP_I2S_VAD_FLAG_V  0x00000001U
#define LP_I2S_VAD_FLAG_S  0
/** LP_I2S_ENERGY_ENOUGH : RO; bitpos: [1]; default: 0;
 *  Reg energy enough observe signal
 */
#define LP_I2S_ENERGY_ENOUGH    (BIT(1))
#define LP_I2S_ENERGY_ENOUGH_M  (LP_I2S_ENERGY_ENOUGH_V << LP_I2S_ENERGY_ENOUGH_S)
#define LP_I2S_ENERGY_ENOUGH_V  0x00000001U
#define LP_I2S_ENERGY_ENOUGH_S  1

/** LP_I2S_RX_MEM_CONF_REG register
 *  I2S VAD Observe register
 */
#define LP_I2S_RX_MEM_CONF_REG (DR_REG_LP_I2S_BASE + 0x8)
/** LP_I2S_RX_MEM_FIFO_CNT : RO; bitpos: [8:0]; default: 0;
 *  The number of data in the rx mem
 */
#define LP_I2S_RX_MEM_FIFO_CNT    0x000001FFU
#define LP_I2S_RX_MEM_FIFO_CNT_M  (LP_I2S_RX_MEM_FIFO_CNT_V << LP_I2S_RX_MEM_FIFO_CNT_S)
#define LP_I2S_RX_MEM_FIFO_CNT_V  0x000001FFU
#define LP_I2S_RX_MEM_FIFO_CNT_S  0
/** LP_I2S_RX_MEM_THRESHOLD : R/W; bitpos: [16:9]; default: 63;
 *  I2S rx mem will trigger an interrupt when the data in the mem is over(not including
 *  equal) reg_rx_mem_threshold
 */
#define LP_I2S_RX_MEM_THRESHOLD    0x000000FFU
#define LP_I2S_RX_MEM_THRESHOLD_M  (LP_I2S_RX_MEM_THRESHOLD_V << LP_I2S_RX_MEM_THRESHOLD_S)
#define LP_I2S_RX_MEM_THRESHOLD_V  0x000000FFU
#define LP_I2S_RX_MEM_THRESHOLD_S  9

/** LP_I2S_INT_RAW_REG register
 *  I2S interrupt raw register, valid in level.
 */
#define LP_I2S_INT_RAW_REG (DR_REG_LP_I2S_BASE + 0xc)
/** LP_I2S_RX_DONE_INT_RAW : RO/WTC/SS; bitpos: [0]; default: 0;
 *  The raw interrupt status bit  for the i2s_rx_done_int interrupt
 */
#define LP_I2S_RX_DONE_INT_RAW    (BIT(0))
#define LP_I2S_RX_DONE_INT_RAW_M  (LP_I2S_RX_DONE_INT_RAW_V << LP_I2S_RX_DONE_INT_RAW_S)
#define LP_I2S_RX_DONE_INT_RAW_V  0x00000001U
#define LP_I2S_RX_DONE_INT_RAW_S  0
/** LP_I2S_RX_HUNG_INT_RAW : RO/WTC/SS; bitpos: [1]; default: 0;
 *  The raw interrupt status bit  for the i2s_rx_hung_int interrupt
 */
#define LP_I2S_RX_HUNG_INT_RAW    (BIT(1))
#define LP_I2S_RX_HUNG_INT_RAW_M  (LP_I2S_RX_HUNG_INT_RAW_V << LP_I2S_RX_HUNG_INT_RAW_S)
#define LP_I2S_RX_HUNG_INT_RAW_V  0x00000001U
#define LP_I2S_RX_HUNG_INT_RAW_S  1
/** LP_I2S_RX_FIFOMEM_UDF_INT_RAW : RO/WTC/SS; bitpos: [2]; default: 0;
 *  The raw interrupt status bit  for the i2s_rx_fifomem_udf_int interrupt
 */
#define LP_I2S_RX_FIFOMEM_UDF_INT_RAW    (BIT(2))
#define LP_I2S_RX_FIFOMEM_UDF_INT_RAW_M  (LP_I2S_RX_FIFOMEM_UDF_INT_RAW_V << LP_I2S_RX_FIFOMEM_UDF_INT_RAW_S)
#define LP_I2S_RX_FIFOMEM_UDF_INT_RAW_V  0x00000001U
#define LP_I2S_RX_FIFOMEM_UDF_INT_RAW_S  2
/** LP_I2S_VAD_DONE_INT_RAW : RO/WTC/SS; bitpos: [3]; default: 0;
 *  The raw interrupt status bit  for the vad_done_int interrupt
 */
#define LP_I2S_VAD_DONE_INT_RAW    (BIT(3))
#define LP_I2S_VAD_DONE_INT_RAW_M  (LP_I2S_VAD_DONE_INT_RAW_V << LP_I2S_VAD_DONE_INT_RAW_S)
#define LP_I2S_VAD_DONE_INT_RAW_V  0x00000001U
#define LP_I2S_VAD_DONE_INT_RAW_S  3
/** LP_I2S_VAD_RESET_DONE_INT_RAW : RO/WTC/SS; bitpos: [4]; default: 0;
 *  The raw interrupt status bit  for the vad_reset_done_int interrupt
 */
#define LP_I2S_VAD_RESET_DONE_INT_RAW    (BIT(4))
#define LP_I2S_VAD_RESET_DONE_INT_RAW_M  (LP_I2S_VAD_RESET_DONE_INT_RAW_V << LP_I2S_VAD_RESET_DONE_INT_RAW_S)
#define LP_I2S_VAD_RESET_DONE_INT_RAW_V  0x00000001U
#define LP_I2S_VAD_RESET_DONE_INT_RAW_S  4
/** LP_I2S_RX_MEM_THRESHOLD_INT_RAW : RO/WTC/SS; bitpos: [5]; default: 0;
 *  The raw interrupt status bit  for the rx_mem_threshold_int interrupt
 */
#define LP_I2S_RX_MEM_THRESHOLD_INT_RAW    (BIT(5))
#define LP_I2S_RX_MEM_THRESHOLD_INT_RAW_M  (LP_I2S_RX_MEM_THRESHOLD_INT_RAW_V << LP_I2S_RX_MEM_THRESHOLD_INT_RAW_S)
#define LP_I2S_RX_MEM_THRESHOLD_INT_RAW_V  0x00000001U
#define LP_I2S_RX_MEM_THRESHOLD_INT_RAW_S  5

/** LP_I2S_INT_ST_REG register
 *  I2S interrupt status register.
 */
#define LP_I2S_INT_ST_REG (DR_REG_LP_I2S_BASE + 0x10)
/** LP_I2S_RX_DONE_INT_ST : RO; bitpos: [0]; default: 0;
 *  The masked interrupt status bit  for the i2s_rx_done_int interrupt
 */
#define LP_I2S_RX_DONE_INT_ST    (BIT(0))
#define LP_I2S_RX_DONE_INT_ST_M  (LP_I2S_RX_DONE_INT_ST_V << LP_I2S_RX_DONE_INT_ST_S)
#define LP_I2S_RX_DONE_INT_ST_V  0x00000001U
#define LP_I2S_RX_DONE_INT_ST_S  0
/** LP_I2S_RX_HUNG_INT_ST : RO; bitpos: [1]; default: 0;
 *  The masked interrupt status bit  for the i2s_rx_hung_int interrupt
 */
#define LP_I2S_RX_HUNG_INT_ST    (BIT(1))
#define LP_I2S_RX_HUNG_INT_ST_M  (LP_I2S_RX_HUNG_INT_ST_V << LP_I2S_RX_HUNG_INT_ST_S)
#define LP_I2S_RX_HUNG_INT_ST_V  0x00000001U
#define LP_I2S_RX_HUNG_INT_ST_S  1
/** LP_I2S_RX_FIFOMEM_UDF_INT_ST : RO; bitpos: [2]; default: 0;
 *  The masked interrupt status bit  for the i2s_rx_fifomem_udf_int interrupt
 */
#define LP_I2S_RX_FIFOMEM_UDF_INT_ST    (BIT(2))
#define LP_I2S_RX_FIFOMEM_UDF_INT_ST_M  (LP_I2S_RX_FIFOMEM_UDF_INT_ST_V << LP_I2S_RX_FIFOMEM_UDF_INT_ST_S)
#define LP_I2S_RX_FIFOMEM_UDF_INT_ST_V  0x00000001U
#define LP_I2S_RX_FIFOMEM_UDF_INT_ST_S  2
/** LP_I2S_VAD_DONE_INT_ST : RO; bitpos: [3]; default: 0;
 *  The masked interrupt status bit  for the vad_done_int interrupt
 */
#define LP_I2S_VAD_DONE_INT_ST    (BIT(3))
#define LP_I2S_VAD_DONE_INT_ST_M  (LP_I2S_VAD_DONE_INT_ST_V << LP_I2S_VAD_DONE_INT_ST_S)
#define LP_I2S_VAD_DONE_INT_ST_V  0x00000001U
#define LP_I2S_VAD_DONE_INT_ST_S  3
/** LP_I2S_VAD_RESET_DONE_INT_ST : RO; bitpos: [4]; default: 0;
 *  The masked interrupt status bit  for the vad_reset_done_int interrupt
 */
#define LP_I2S_VAD_RESET_DONE_INT_ST    (BIT(4))
#define LP_I2S_VAD_RESET_DONE_INT_ST_M  (LP_I2S_VAD_RESET_DONE_INT_ST_V << LP_I2S_VAD_RESET_DONE_INT_ST_S)
#define LP_I2S_VAD_RESET_DONE_INT_ST_V  0x00000001U
#define LP_I2S_VAD_RESET_DONE_INT_ST_S  4
/** LP_I2S_RX_MEM_THRESHOLD_INT_ST : RO; bitpos: [5]; default: 0;
 *  The masked interrupt status bit  for the rx_mem_threshold_int interrupt
 */
#define LP_I2S_RX_MEM_THRESHOLD_INT_ST    (BIT(5))
#define LP_I2S_RX_MEM_THRESHOLD_INT_ST_M  (LP_I2S_RX_MEM_THRESHOLD_INT_ST_V << LP_I2S_RX_MEM_THRESHOLD_INT_ST_S)
#define LP_I2S_RX_MEM_THRESHOLD_INT_ST_V  0x00000001U
#define LP_I2S_RX_MEM_THRESHOLD_INT_ST_S  5

/** LP_I2S_INT_ENA_REG register
 *  I2S interrupt enable register.
 */
#define LP_I2S_INT_ENA_REG (DR_REG_LP_I2S_BASE + 0x14)
/** LP_I2S_RX_DONE_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  The interrupt enable bit  for the i2s_rx_done_int interrupt
 */
#define LP_I2S_RX_DONE_INT_ENA    (BIT(0))
#define LP_I2S_RX_DONE_INT_ENA_M  (LP_I2S_RX_DONE_INT_ENA_V << LP_I2S_RX_DONE_INT_ENA_S)
#define LP_I2S_RX_DONE_INT_ENA_V  0x00000001U
#define LP_I2S_RX_DONE_INT_ENA_S  0
/** LP_I2S_RX_HUNG_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  The interrupt enable bit  for the i2s_rx_hung_int interrupt
 */
#define LP_I2S_RX_HUNG_INT_ENA    (BIT(1))
#define LP_I2S_RX_HUNG_INT_ENA_M  (LP_I2S_RX_HUNG_INT_ENA_V << LP_I2S_RX_HUNG_INT_ENA_S)
#define LP_I2S_RX_HUNG_INT_ENA_V  0x00000001U
#define LP_I2S_RX_HUNG_INT_ENA_S  1
/** LP_I2S_RX_FIFOMEM_UDF_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  The interrupt enable bit  for the i2s_rx_fifomem_udf_int interrupt
 */
#define LP_I2S_RX_FIFOMEM_UDF_INT_ENA    (BIT(2))
#define LP_I2S_RX_FIFOMEM_UDF_INT_ENA_M  (LP_I2S_RX_FIFOMEM_UDF_INT_ENA_V << LP_I2S_RX_FIFOMEM_UDF_INT_ENA_S)
#define LP_I2S_RX_FIFOMEM_UDF_INT_ENA_V  0x00000001U
#define LP_I2S_RX_FIFOMEM_UDF_INT_ENA_S  2
/** LP_I2S_VAD_DONE_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  The interrupt enable bit  for the vad_done_int interrupt
 */
#define LP_I2S_VAD_DONE_INT_ENA    (BIT(3))
#define LP_I2S_VAD_DONE_INT_ENA_M  (LP_I2S_VAD_DONE_INT_ENA_V << LP_I2S_VAD_DONE_INT_ENA_S)
#define LP_I2S_VAD_DONE_INT_ENA_V  0x00000001U
#define LP_I2S_VAD_DONE_INT_ENA_S  3
/** LP_I2S_VAD_RESET_DONE_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  The interrupt enable bit  for the vad_reset_done_int interrupt
 */
#define LP_I2S_VAD_RESET_DONE_INT_ENA    (BIT(4))
#define LP_I2S_VAD_RESET_DONE_INT_ENA_M  (LP_I2S_VAD_RESET_DONE_INT_ENA_V << LP_I2S_VAD_RESET_DONE_INT_ENA_S)
#define LP_I2S_VAD_RESET_DONE_INT_ENA_V  0x00000001U
#define LP_I2S_VAD_RESET_DONE_INT_ENA_S  4
/** LP_I2S_RX_MEM_THRESHOLD_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  The interrupt enable bit  for the rx_mem_threshold_int interrupt
 */
#define LP_I2S_RX_MEM_THRESHOLD_INT_ENA    (BIT(5))
#define LP_I2S_RX_MEM_THRESHOLD_INT_ENA_M  (LP_I2S_RX_MEM_THRESHOLD_INT_ENA_V << LP_I2S_RX_MEM_THRESHOLD_INT_ENA_S)
#define LP_I2S_RX_MEM_THRESHOLD_INT_ENA_V  0x00000001U
#define LP_I2S_RX_MEM_THRESHOLD_INT_ENA_S  5

/** LP_I2S_INT_CLR_REG register
 *  I2S interrupt clear register.
 */
#define LP_I2S_INT_CLR_REG (DR_REG_LP_I2S_BASE + 0x18)
/** LP_I2S_RX_DONE_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Set this bit to clear the i2s_rx_done_int interrupt
 */
#define LP_I2S_RX_DONE_INT_CLR    (BIT(0))
#define LP_I2S_RX_DONE_INT_CLR_M  (LP_I2S_RX_DONE_INT_CLR_V << LP_I2S_RX_DONE_INT_CLR_S)
#define LP_I2S_RX_DONE_INT_CLR_V  0x00000001U
#define LP_I2S_RX_DONE_INT_CLR_S  0
/** LP_I2S_RX_HUNG_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Set this bit to clear the i2s_rx_hung_int interrupt
 */
#define LP_I2S_RX_HUNG_INT_CLR    (BIT(1))
#define LP_I2S_RX_HUNG_INT_CLR_M  (LP_I2S_RX_HUNG_INT_CLR_V << LP_I2S_RX_HUNG_INT_CLR_S)
#define LP_I2S_RX_HUNG_INT_CLR_V  0x00000001U
#define LP_I2S_RX_HUNG_INT_CLR_S  1
/** LP_I2S_RX_FIFOMEM_UDF_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Set this bit to clear the i2s_rx_fifomem_udf_int interrupt
 */
#define LP_I2S_RX_FIFOMEM_UDF_INT_CLR    (BIT(2))
#define LP_I2S_RX_FIFOMEM_UDF_INT_CLR_M  (LP_I2S_RX_FIFOMEM_UDF_INT_CLR_V << LP_I2S_RX_FIFOMEM_UDF_INT_CLR_S)
#define LP_I2S_RX_FIFOMEM_UDF_INT_CLR_V  0x00000001U
#define LP_I2S_RX_FIFOMEM_UDF_INT_CLR_S  2
/** LP_I2S_VAD_DONE_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Set this bit to clear the vad_done_int interrupt
 */
#define LP_I2S_VAD_DONE_INT_CLR    (BIT(3))
#define LP_I2S_VAD_DONE_INT_CLR_M  (LP_I2S_VAD_DONE_INT_CLR_V << LP_I2S_VAD_DONE_INT_CLR_S)
#define LP_I2S_VAD_DONE_INT_CLR_V  0x00000001U
#define LP_I2S_VAD_DONE_INT_CLR_S  3
/** LP_I2S_VAD_RESET_DONE_INT_CLR : WT; bitpos: [4]; default: 0;
 *  Set this bit to clear the vad_reset_done_int interrupt
 */
#define LP_I2S_VAD_RESET_DONE_INT_CLR    (BIT(4))
#define LP_I2S_VAD_RESET_DONE_INT_CLR_M  (LP_I2S_VAD_RESET_DONE_INT_CLR_V << LP_I2S_VAD_RESET_DONE_INT_CLR_S)
#define LP_I2S_VAD_RESET_DONE_INT_CLR_V  0x00000001U
#define LP_I2S_VAD_RESET_DONE_INT_CLR_S  4
/** LP_I2S_RX_MEM_THRESHOLD_INT_CLR : WT; bitpos: [5]; default: 0;
 *  Set this bit to clear the rx_mem_threshold_int interrupt
 */
#define LP_I2S_RX_MEM_THRESHOLD_INT_CLR    (BIT(5))
#define LP_I2S_RX_MEM_THRESHOLD_INT_CLR_M  (LP_I2S_RX_MEM_THRESHOLD_INT_CLR_V << LP_I2S_RX_MEM_THRESHOLD_INT_CLR_S)
#define LP_I2S_RX_MEM_THRESHOLD_INT_CLR_V  0x00000001U
#define LP_I2S_RX_MEM_THRESHOLD_INT_CLR_S  5

/** LP_I2S_RX_CONF_REG register
 *  I2S RX configure register
 */
#define LP_I2S_RX_CONF_REG (DR_REG_LP_I2S_BASE + 0x20)
/** LP_I2S_RX_RESET : WT; bitpos: [0]; default: 0;
 *  Set this bit to reset receiver
 */
#define LP_I2S_RX_RESET    (BIT(0))
#define LP_I2S_RX_RESET_M  (LP_I2S_RX_RESET_V << LP_I2S_RX_RESET_S)
#define LP_I2S_RX_RESET_V  0x00000001U
#define LP_I2S_RX_RESET_S  0
/** LP_I2S_RX_FIFO_RESET : WT; bitpos: [1]; default: 0;
 *  Set this bit to reset Rx AFIFO
 */
#define LP_I2S_RX_FIFO_RESET    (BIT(1))
#define LP_I2S_RX_FIFO_RESET_M  (LP_I2S_RX_FIFO_RESET_V << LP_I2S_RX_FIFO_RESET_S)
#define LP_I2S_RX_FIFO_RESET_V  0x00000001U
#define LP_I2S_RX_FIFO_RESET_S  1
/** LP_I2S_RX_START : R/W; bitpos: [2]; default: 0;
 *  Set this bit to start receiving data
 */
#define LP_I2S_RX_START    (BIT(2))
#define LP_I2S_RX_START_M  (LP_I2S_RX_START_V << LP_I2S_RX_START_S)
#define LP_I2S_RX_START_V  0x00000001U
#define LP_I2S_RX_START_S  2
/** LP_I2S_RX_SLAVE_MOD : R/W; bitpos: [3]; default: 0;
 *  Set this bit to enable slave receiver mode
 */
#define LP_I2S_RX_SLAVE_MOD    (BIT(3))
#define LP_I2S_RX_SLAVE_MOD_M  (LP_I2S_RX_SLAVE_MOD_V << LP_I2S_RX_SLAVE_MOD_S)
#define LP_I2S_RX_SLAVE_MOD_V  0x00000001U
#define LP_I2S_RX_SLAVE_MOD_S  3
/** LP_I2S_RX_FIFOMEM_RESET : WT; bitpos: [4]; default: 0;
 *  Set this bit to reset Rx Syncfifomem
 */
#define LP_I2S_RX_FIFOMEM_RESET    (BIT(4))
#define LP_I2S_RX_FIFOMEM_RESET_M  (LP_I2S_RX_FIFOMEM_RESET_V << LP_I2S_RX_FIFOMEM_RESET_S)
#define LP_I2S_RX_FIFOMEM_RESET_V  0x00000001U
#define LP_I2S_RX_FIFOMEM_RESET_S  4
/** LP_I2S_RX_MONO : R/W; bitpos: [5]; default: 0;
 *  Set this bit to enable receiver  in mono mode
 */
#define LP_I2S_RX_MONO    (BIT(5))
#define LP_I2S_RX_MONO_M  (LP_I2S_RX_MONO_V << LP_I2S_RX_MONO_S)
#define LP_I2S_RX_MONO_V  0x00000001U
#define LP_I2S_RX_MONO_S  5
/** LP_I2S_RX_BIG_ENDIAN : R/W; bitpos: [7]; default: 0;
 *  I2S Rx byte endian, 1: low addr value to high addr. 0: low addr with low addr value.
 */
#define LP_I2S_RX_BIG_ENDIAN    (BIT(7))
#define LP_I2S_RX_BIG_ENDIAN_M  (LP_I2S_RX_BIG_ENDIAN_V << LP_I2S_RX_BIG_ENDIAN_S)
#define LP_I2S_RX_BIG_ENDIAN_V  0x00000001U
#define LP_I2S_RX_BIG_ENDIAN_S  7
/** LP_I2S_RX_UPDATE : R/W/SC; bitpos: [8]; default: 0;
 *  Set 1 to update I2S RX registers from APB clock domain to I2S RX clock domain. This
 *  bit will be cleared by hardware after update register done.
 */
#define LP_I2S_RX_UPDATE    (BIT(8))
#define LP_I2S_RX_UPDATE_M  (LP_I2S_RX_UPDATE_V << LP_I2S_RX_UPDATE_S)
#define LP_I2S_RX_UPDATE_V  0x00000001U
#define LP_I2S_RX_UPDATE_S  8
/** LP_I2S_RX_MONO_FST_VLD : R/W; bitpos: [9]; default: 1;
 *  1: The first channel data value is valid in I2S RX mono mode.   0: The second
 *  channel data value is valid in I2S RX mono mode.
 */
#define LP_I2S_RX_MONO_FST_VLD    (BIT(9))
#define LP_I2S_RX_MONO_FST_VLD_M  (LP_I2S_RX_MONO_FST_VLD_V << LP_I2S_RX_MONO_FST_VLD_S)
#define LP_I2S_RX_MONO_FST_VLD_V  0x00000001U
#define LP_I2S_RX_MONO_FST_VLD_S  9
/** LP_I2S_RX_PCM_CONF : R/W; bitpos: [11:10]; default: 1;
 *  I2S RX compress/decompress configuration bit. & 0 (atol): A-Law decompress, 1
 *  (ltoa) : A-Law compress, 2 (utol) : u-Law decompress, 3 (ltou) : u-Law compress. &
 */
#define LP_I2S_RX_PCM_CONF    0x00000003U
#define LP_I2S_RX_PCM_CONF_M  (LP_I2S_RX_PCM_CONF_V << LP_I2S_RX_PCM_CONF_S)
#define LP_I2S_RX_PCM_CONF_V  0x00000003U
#define LP_I2S_RX_PCM_CONF_S  10
/** LP_I2S_RX_PCM_BYPASS : R/W; bitpos: [12]; default: 1;
 *  Set this bit to bypass Compress/Decompress module for received data.
 */
#define LP_I2S_RX_PCM_BYPASS    (BIT(12))
#define LP_I2S_RX_PCM_BYPASS_M  (LP_I2S_RX_PCM_BYPASS_V << LP_I2S_RX_PCM_BYPASS_S)
#define LP_I2S_RX_PCM_BYPASS_V  0x00000001U
#define LP_I2S_RX_PCM_BYPASS_S  12
/** LP_I2S_RX_STOP_MODE : R/W; bitpos: [14:13]; default: 0;
 *  0  : I2S Rx only stop when reg_rx_start is cleared.   1: Stop when reg_rx_start is
 *  0 or in_suc_eof is 1.   2:  Stop I2S RX when reg_rx_start is 0 or RX FIFO is full.
 */
#define LP_I2S_RX_STOP_MODE    0x00000003U
#define LP_I2S_RX_STOP_MODE_M  (LP_I2S_RX_STOP_MODE_V << LP_I2S_RX_STOP_MODE_S)
#define LP_I2S_RX_STOP_MODE_V  0x00000003U
#define LP_I2S_RX_STOP_MODE_S  13
/** LP_I2S_RX_LEFT_ALIGN : R/W; bitpos: [15]; default: 1;
 *  1: I2S RX left alignment mode. 0: I2S RX right alignment mode.
 */
#define LP_I2S_RX_LEFT_ALIGN    (BIT(15))
#define LP_I2S_RX_LEFT_ALIGN_M  (LP_I2S_RX_LEFT_ALIGN_V << LP_I2S_RX_LEFT_ALIGN_S)
#define LP_I2S_RX_LEFT_ALIGN_V  0x00000001U
#define LP_I2S_RX_LEFT_ALIGN_S  15
/** LP_I2S_RX_24_FILL_EN : R/W; bitpos: [16]; default: 0;
 *  1: store 24 channel bits to 32 bits. 0:store 24 channel bits to 24 bits.
 */
#define LP_I2S_RX_24_FILL_EN    (BIT(16))
#define LP_I2S_RX_24_FILL_EN_M  (LP_I2S_RX_24_FILL_EN_V << LP_I2S_RX_24_FILL_EN_S)
#define LP_I2S_RX_24_FILL_EN_V  0x00000001U
#define LP_I2S_RX_24_FILL_EN_S  16
/** LP_I2S_RX_WS_IDLE_POL : R/W; bitpos: [17]; default: 0;
 *  0: WS should be 0 when receiving left channel data, and WS is 1in right channel.
 *  1: WS should be 1 when receiving left channel data, and WS is 0in right channel.
 */
#define LP_I2S_RX_WS_IDLE_POL    (BIT(17))
#define LP_I2S_RX_WS_IDLE_POL_M  (LP_I2S_RX_WS_IDLE_POL_V << LP_I2S_RX_WS_IDLE_POL_S)
#define LP_I2S_RX_WS_IDLE_POL_V  0x00000001U
#define LP_I2S_RX_WS_IDLE_POL_S  17
/** LP_I2S_RX_BIT_ORDER : R/W; bitpos: [18]; default: 0;
 *  I2S Rx bit endian. 1:small endian, the LSB is received first. 0:big endian, the MSB
 *  is received first.
 */
#define LP_I2S_RX_BIT_ORDER    (BIT(18))
#define LP_I2S_RX_BIT_ORDER_M  (LP_I2S_RX_BIT_ORDER_V << LP_I2S_RX_BIT_ORDER_S)
#define LP_I2S_RX_BIT_ORDER_V  0x00000001U
#define LP_I2S_RX_BIT_ORDER_S  18
/** LP_I2S_RX_TDM_EN : R/W; bitpos: [19]; default: 0;
 *  1: Enable I2S TDM Rx mode . 0: Disable.
 */
#define LP_I2S_RX_TDM_EN    (BIT(19))
#define LP_I2S_RX_TDM_EN_M  (LP_I2S_RX_TDM_EN_V << LP_I2S_RX_TDM_EN_S)
#define LP_I2S_RX_TDM_EN_V  0x00000001U
#define LP_I2S_RX_TDM_EN_S  19
/** LP_I2S_RX_PDM_EN : R/W; bitpos: [20]; default: 0;
 *  1: Enable I2S PDM Rx mode . 0: Disable.
 */
#define LP_I2S_RX_PDM_EN    (BIT(20))
#define LP_I2S_RX_PDM_EN_M  (LP_I2S_RX_PDM_EN_V << LP_I2S_RX_PDM_EN_S)
#define LP_I2S_RX_PDM_EN_V  0x00000001U
#define LP_I2S_RX_PDM_EN_S  20

/** LP_I2S_RX_CONF1_REG register
 *  I2S RX configure register 1
 */
#define LP_I2S_RX_CONF1_REG (DR_REG_LP_I2S_BASE + 0x28)
/** LP_I2S_RX_TDM_WS_WIDTH : R/W; bitpos: [6:0]; default: 0;
 *  The width of rx_ws_out in TDM mode is (I2S_RX_TDM_WS_WIDTH[6:0] +1) * T_bck
 */
#define LP_I2S_RX_TDM_WS_WIDTH    0x0000007FU
#define LP_I2S_RX_TDM_WS_WIDTH_M  (LP_I2S_RX_TDM_WS_WIDTH_V << LP_I2S_RX_TDM_WS_WIDTH_S)
#define LP_I2S_RX_TDM_WS_WIDTH_V  0x0000007FU
#define LP_I2S_RX_TDM_WS_WIDTH_S  0
/** LP_I2S_RX_BCK_DIV_NUM : R/W; bitpos: [12:7]; default: 6;
 *  Bit clock configuration bits in receiver mode.
 */
#define LP_I2S_RX_BCK_DIV_NUM    0x0000003FU
#define LP_I2S_RX_BCK_DIV_NUM_M  (LP_I2S_RX_BCK_DIV_NUM_V << LP_I2S_RX_BCK_DIV_NUM_S)
#define LP_I2S_RX_BCK_DIV_NUM_V  0x0000003FU
#define LP_I2S_RX_BCK_DIV_NUM_S  7
/** LP_I2S_RX_BITS_MOD : R/W; bitpos: [17:13]; default: 15;
 *  Set the bits to configure the valid data bit length of I2S receiver channel. 7: all
 *  the valid channel data is in 8-bit-mode. 15: all the valid channel data is in
 *  16-bit-mode. 23: all the valid channel data is in 24-bit-mode. 31:all the valid
 *  channel data is in 32-bit-mode.
 */
#define LP_I2S_RX_BITS_MOD    0x0000001FU
#define LP_I2S_RX_BITS_MOD_M  (LP_I2S_RX_BITS_MOD_V << LP_I2S_RX_BITS_MOD_S)
#define LP_I2S_RX_BITS_MOD_V  0x0000001FU
#define LP_I2S_RX_BITS_MOD_S  13
/** LP_I2S_RX_HALF_SAMPLE_BITS : R/W; bitpos: [23:18]; default: 15;
 *  I2S Rx half sample bits -1.
 */
#define LP_I2S_RX_HALF_SAMPLE_BITS    0x0000003FU
#define LP_I2S_RX_HALF_SAMPLE_BITS_M  (LP_I2S_RX_HALF_SAMPLE_BITS_V << LP_I2S_RX_HALF_SAMPLE_BITS_S)
#define LP_I2S_RX_HALF_SAMPLE_BITS_V  0x0000003FU
#define LP_I2S_RX_HALF_SAMPLE_BITS_S  18
/** LP_I2S_RX_TDM_CHAN_BITS : R/W; bitpos: [28:24]; default: 15;
 *  The Rx bit number for each channel minus 1in TDM mode.
 */
#define LP_I2S_RX_TDM_CHAN_BITS    0x0000001FU
#define LP_I2S_RX_TDM_CHAN_BITS_M  (LP_I2S_RX_TDM_CHAN_BITS_V << LP_I2S_RX_TDM_CHAN_BITS_S)
#define LP_I2S_RX_TDM_CHAN_BITS_V  0x0000001FU
#define LP_I2S_RX_TDM_CHAN_BITS_S  24
/** LP_I2S_RX_MSB_SHIFT : R/W; bitpos: [29]; default: 1;
 *  Set this bit to enable receiver in Phillips standard mode
 */
#define LP_I2S_RX_MSB_SHIFT    (BIT(29))
#define LP_I2S_RX_MSB_SHIFT_M  (LP_I2S_RX_MSB_SHIFT_V << LP_I2S_RX_MSB_SHIFT_S)
#define LP_I2S_RX_MSB_SHIFT_V  0x00000001U
#define LP_I2S_RX_MSB_SHIFT_S  29

/** LP_I2S_RX_TDM_CTRL_REG register
 *  I2S TX TDM mode control register
 */
#define LP_I2S_RX_TDM_CTRL_REG (DR_REG_LP_I2S_BASE + 0x50)
/** LP_I2S_RX_TDM_PDM_CHAN0_EN : R/W; bitpos: [0]; default: 1;
 *  1: Enable the valid data input of I2S RX TDM or PDM channel $n. 0:  Disable, just
 *  input 0 in this channel.
 */
#define LP_I2S_RX_TDM_PDM_CHAN0_EN    (BIT(0))
#define LP_I2S_RX_TDM_PDM_CHAN0_EN_M  (LP_I2S_RX_TDM_PDM_CHAN0_EN_V << LP_I2S_RX_TDM_PDM_CHAN0_EN_S)
#define LP_I2S_RX_TDM_PDM_CHAN0_EN_V  0x00000001U
#define LP_I2S_RX_TDM_PDM_CHAN0_EN_S  0
/** LP_I2S_RX_TDM_PDM_CHAN1_EN : R/W; bitpos: [1]; default: 1;
 *  1: Enable the valid data input of I2S RX TDM or PDM channel $n. 0:  Disable, just
 *  input 0 in this channel.
 */
#define LP_I2S_RX_TDM_PDM_CHAN1_EN    (BIT(1))
#define LP_I2S_RX_TDM_PDM_CHAN1_EN_M  (LP_I2S_RX_TDM_PDM_CHAN1_EN_V << LP_I2S_RX_TDM_PDM_CHAN1_EN_S)
#define LP_I2S_RX_TDM_PDM_CHAN1_EN_V  0x00000001U
#define LP_I2S_RX_TDM_PDM_CHAN1_EN_S  1
/** LP_I2S_RX_TDM_TOT_CHAN_NUM : R/W; bitpos: [19:16]; default: 0;
 *  The total channel number of I2S TX TDM mode.
 */
#define LP_I2S_RX_TDM_TOT_CHAN_NUM    0x0000000FU
#define LP_I2S_RX_TDM_TOT_CHAN_NUM_M  (LP_I2S_RX_TDM_TOT_CHAN_NUM_V << LP_I2S_RX_TDM_TOT_CHAN_NUM_S)
#define LP_I2S_RX_TDM_TOT_CHAN_NUM_V  0x0000000FU
#define LP_I2S_RX_TDM_TOT_CHAN_NUM_S  16

