espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/lp_i2s_reg.h
/** LP_I2S_RX_TIMING_REG register
 *  I2S RX timing control register
 */
#define LP_I2S_RX_TIMING_REG (DR_REG_LP_I2S_BASE + 0x58)
/** LP_I2S_RX_SD_IN_DM : R/W; bitpos: [1:0]; default: 0;
 *  The delay mode of I2S Rx SD input signal. 0: bypass. 1: delay by pos edge.  2:
 *  delay by neg edge. 3: not used.
 */
#define LP_I2S_RX_SD_IN_DM    0x00000003U
#define LP_I2S_RX_SD_IN_DM_M  (LP_I2S_RX_SD_IN_DM_V << LP_I2S_RX_SD_IN_DM_S)
#define LP_I2S_RX_SD_IN_DM_V  0x00000003U
#define LP_I2S_RX_SD_IN_DM_S  0
/** LP_I2S_RX_WS_OUT_DM : R/W; bitpos: [17:16]; default: 0;
 *  The delay mode of I2S Rx WS output signal. 0: bypass. 1: delay by pos edge.  2:
 *  delay by neg edge. 3: not used.
 */
#define LP_I2S_RX_WS_OUT_DM    0x00000003U
#define LP_I2S_RX_WS_OUT_DM_M  (LP_I2S_RX_WS_OUT_DM_V << LP_I2S_RX_WS_OUT_DM_S)
#define LP_I2S_RX_WS_OUT_DM_V  0x00000003U
#define LP_I2S_RX_WS_OUT_DM_S  16
/** LP_I2S_RX_BCK_OUT_DM : R/W; bitpos: [21:20]; default: 0;
 *  The delay mode of I2S Rx BCK output signal. 0: bypass. 1: delay by pos edge.  2:
 *  delay by neg edge. 3: not used.
 */
#define LP_I2S_RX_BCK_OUT_DM    0x00000003U
#define LP_I2S_RX_BCK_OUT_DM_M  (LP_I2S_RX_BCK_OUT_DM_V << LP_I2S_RX_BCK_OUT_DM_S)
#define LP_I2S_RX_BCK_OUT_DM_V  0x00000003U
#define LP_I2S_RX_BCK_OUT_DM_S  20
/** LP_I2S_RX_WS_IN_DM : R/W; bitpos: [25:24]; default: 0;
 *  The delay mode of I2S Rx WS input signal. 0: bypass. 1: delay by pos edge.  2:
 *  delay by neg edge. 3: not used.
 */
#define LP_I2S_RX_WS_IN_DM    0x00000003U
#define LP_I2S_RX_WS_IN_DM_M  (LP_I2S_RX_WS_IN_DM_V << LP_I2S_RX_WS_IN_DM_S)
#define LP_I2S_RX_WS_IN_DM_V  0x00000003U
#define LP_I2S_RX_WS_IN_DM_S  24
/** LP_I2S_RX_BCK_IN_DM : R/W; bitpos: [29:28]; default: 0;
 *  The delay mode of I2S Rx BCK input signal. 0: bypass. 1: delay by pos edge.  2:
 *  delay by neg edge. 3: not used.
 */
#define LP_I2S_RX_BCK_IN_DM    0x00000003U
#define LP_I2S_RX_BCK_IN_DM_M  (LP_I2S_RX_BCK_IN_DM_V << LP_I2S_RX_BCK_IN_DM_S)
#define LP_I2S_RX_BCK_IN_DM_V  0x00000003U
#define LP_I2S_RX_BCK_IN_DM_S  28

/** LP_I2S_LC_HUNG_CONF_REG register
 *  I2S HUNG configure register.
 */
#define LP_I2S_LC_HUNG_CONF_REG (DR_REG_LP_I2S_BASE + 0x60)
/** LP_I2S_LC_FIFO_TIMEOUT : R/W; bitpos: [7:0]; default: 16;
 *  the i2s_tx_hung_int interrupt or the i2s_rx_hung_int interrupt will be triggered
 *  when fifo hung counter is equal to this value
 */
#define LP_I2S_LC_FIFO_TIMEOUT    0x000000FFU
#define LP_I2S_LC_FIFO_TIMEOUT_M  (LP_I2S_LC_FIFO_TIMEOUT_V << LP_I2S_LC_FIFO_TIMEOUT_S)
#define LP_I2S_LC_FIFO_TIMEOUT_V  0x000000FFU
#define LP_I2S_LC_FIFO_TIMEOUT_S  0
/** LP_I2S_LC_FIFO_TIMEOUT_SHIFT : R/W; bitpos: [10:8]; default: 0;
 *  The bits are used to scale tick counter threshold. The tick counter is reset when
 *  counter value >= 88000/2^i2s_lc_fifo_timeout_shift
 */
#define LP_I2S_LC_FIFO_TIMEOUT_SHIFT    0x00000007U
#define LP_I2S_LC_FIFO_TIMEOUT_SHIFT_M  (LP_I2S_LC_FIFO_TIMEOUT_SHIFT_V << LP_I2S_LC_FIFO_TIMEOUT_SHIFT_S)
#define LP_I2S_LC_FIFO_TIMEOUT_SHIFT_V  0x00000007U
#define LP_I2S_LC_FIFO_TIMEOUT_SHIFT_S  8
/** LP_I2S_LC_FIFO_TIMEOUT_ENA : R/W; bitpos: [11]; default: 1;
 *  The enable bit for FIFO timeout
 */
#define LP_I2S_LC_FIFO_TIMEOUT_ENA    (BIT(11))
#define LP_I2S_LC_FIFO_TIMEOUT_ENA_M  (LP_I2S_LC_FIFO_TIMEOUT_ENA_V << LP_I2S_LC_FIFO_TIMEOUT_ENA_S)
#define LP_I2S_LC_FIFO_TIMEOUT_ENA_V  0x00000001U
#define LP_I2S_LC_FIFO_TIMEOUT_ENA_S  11

/** LP_I2S_RXEOF_NUM_REG register
 *  I2S RX data number control register.
 */
#define LP_I2S_RXEOF_NUM_REG (DR_REG_LP_I2S_BASE + 0x64)
/** LP_I2S_RX_EOF_NUM : R/W; bitpos: [11:0]; default: 64;
 *  The receive data bit length is (I2S_RX_BITS_MOD[4:0] + 1) * (REG_RX_EOF_NUM[11:0] +
 *  1) . It will trigger in_suc_eof interrupt in the configured DMA RX channel.
 */
#define LP_I2S_RX_EOF_NUM    0x00000FFFU
#define LP_I2S_RX_EOF_NUM_M  (LP_I2S_RX_EOF_NUM_V << LP_I2S_RX_EOF_NUM_S)
#define LP_I2S_RX_EOF_NUM_V  0x00000FFFU
#define LP_I2S_RX_EOF_NUM_S  0

/** LP_I2S_CONF_SIGLE_DATA_REG register
 *  I2S signal data register
 */
#define LP_I2S_CONF_SIGLE_DATA_REG (DR_REG_LP_I2S_BASE + 0x68)
/** LP_I2S_SINGLE_DATA : R/W; bitpos: [31:0]; default: 0;
 *  The configured constant channel data to be sent out.
 */
#define LP_I2S_SINGLE_DATA    0xFFFFFFFFU
#define LP_I2S_SINGLE_DATA_M  (LP_I2S_SINGLE_DATA_V << LP_I2S_SINGLE_DATA_S)
#define LP_I2S_SINGLE_DATA_V  0xFFFFFFFFU
#define LP_I2S_SINGLE_DATA_S  0

/** LP_I2S_RX_PDM_CONF_REG register
 *  I2S RX configure register
 */
#define LP_I2S_RX_PDM_CONF_REG (DR_REG_LP_I2S_BASE + 0x70)
/** LP_I2S_RX_PDM2PCM_EN : R/W; bitpos: [19]; default: 0;
 *  1: Enable PDM2PCM RX mode. 0: DIsable.
 */
#define LP_I2S_RX_PDM2PCM_EN    (BIT(19))
#define LP_I2S_RX_PDM2PCM_EN_M  (LP_I2S_RX_PDM2PCM_EN_V << LP_I2S_RX_PDM2PCM_EN_S)
#define LP_I2S_RX_PDM2PCM_EN_V  0x00000001U
#define LP_I2S_RX_PDM2PCM_EN_S  19
/** LP_I2S_RX_PDM_SINC_DSR_16_EN : R/W; bitpos: [20]; default: 0;
 *  Configure the down sampling rate of PDM RX filter group1 module. 1: The  down
 *  sampling rate is 128. 0: down sampling rate is 64.
 */
#define LP_I2S_RX_PDM_SINC_DSR_16_EN    (BIT(20))
#define LP_I2S_RX_PDM_SINC_DSR_16_EN_M  (LP_I2S_RX_PDM_SINC_DSR_16_EN_V << LP_I2S_RX_PDM_SINC_DSR_16_EN_S)
#define LP_I2S_RX_PDM_SINC_DSR_16_EN_V  0x00000001U
#define LP_I2S_RX_PDM_SINC_DSR_16_EN_S  20
/** LP_I2S_RX_PDM2PCM_AMPLIFY_NUM : R/W; bitpos: [24:21]; default: 1;
 *  Configure PDM RX amplify number.
 */
#define LP_I2S_RX_PDM2PCM_AMPLIFY_NUM    0x0000000FU
#define LP_I2S_RX_PDM2PCM_AMPLIFY_NUM_M  (LP_I2S_RX_PDM2PCM_AMPLIFY_NUM_V << LP_I2S_RX_PDM2PCM_AMPLIFY_NUM_S)
#define LP_I2S_RX_PDM2PCM_AMPLIFY_NUM_V  0x0000000FU
#define LP_I2S_RX_PDM2PCM_AMPLIFY_NUM_S  21
/** LP_I2S_RX_PDM_HP_BYPASS : R/W; bitpos: [25]; default: 0;
 *  I2S PDM RX bypass hp filter or not.
 */
#define LP_I2S_RX_PDM_HP_BYPASS    (BIT(25))
#define LP_I2S_RX_PDM_HP_BYPASS_M  (LP_I2S_RX_PDM_HP_BYPASS_V << LP_I2S_RX_PDM_HP_BYPASS_S)
#define LP_I2S_RX_PDM_HP_BYPASS_V  0x00000001U
#define LP_I2S_RX_PDM_HP_BYPASS_S  25
/** LP_I2S_RX_IIR_HP_MULT12_5 : R/W; bitpos: [28:26]; default: 6;
 *  The fourth parameter of PDM RX IIR_HP filter stage 2 is (504 +
 *  LP_I2S_RX_IIR_HP_MULT12_5[2:0])
 */
#define LP_I2S_RX_IIR_HP_MULT12_5    0x00000007U
#define LP_I2S_RX_IIR_HP_MULT12_5_M  (LP_I2S_RX_IIR_HP_MULT12_5_V << LP_I2S_RX_IIR_HP_MULT12_5_S)
#define LP_I2S_RX_IIR_HP_MULT12_5_V  0x00000007U
#define LP_I2S_RX_IIR_HP_MULT12_5_S  26
/** LP_I2S_RX_IIR_HP_MULT12_0 : R/W; bitpos: [31:29]; default: 7;
 *  The fourth parameter of PDM RX IIR_HP filter stage 1 is (504 +
 *  LP_I2S_RX_IIR_HP_MULT12_0[2:0])
 */
#define LP_I2S_RX_IIR_HP_MULT12_0    0x00000007U
#define LP_I2S_RX_IIR_HP_MULT12_0_M  (LP_I2S_RX_IIR_HP_MULT12_0_V << LP_I2S_RX_IIR_HP_MULT12_0_S)
#define LP_I2S_RX_IIR_HP_MULT12_0_V  0x00000007U
#define LP_I2S_RX_IIR_HP_MULT12_0_S  29

/** LP_I2S_ECO_LOW_REG register
 *  I2S ECO register
 */
#define LP_I2S_ECO_LOW_REG (DR_REG_LP_I2S_BASE + 0x74)
/** LP_I2S_RDN_ECO_LOW : R/W; bitpos: [31:0]; default: 0;
 *  logic low eco registers
 */
#define LP_I2S_RDN_ECO_LOW    0xFFFFFFFFU
#define LP_I2S_RDN_ECO_LOW_M  (LP_I2S_RDN_ECO_LOW_V << LP_I2S_RDN_ECO_LOW_S)
#define LP_I2S_RDN_ECO_LOW_V  0xFFFFFFFFU
#define LP_I2S_RDN_ECO_LOW_S  0

