espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/lp_i2s_reg.h
/** LP_I2S_ECO_HIGH_REG register
 *  I2S ECO register
 */
#define LP_I2S_ECO_HIGH_REG (DR_REG_LP_I2S_BASE + 0x78)
/** LP_I2S_RDN_ECO_HIGH : R/W; bitpos: [31:0]; default: 4294967295;
 *  logic high eco registers
 */
#define LP_I2S_RDN_ECO_HIGH    0xFFFFFFFFU
#define LP_I2S_RDN_ECO_HIGH_M  (LP_I2S_RDN_ECO_HIGH_V << LP_I2S_RDN_ECO_HIGH_S)
#define LP_I2S_RDN_ECO_HIGH_V  0xFFFFFFFFU
#define LP_I2S_RDN_ECO_HIGH_S  0

/** LP_I2S_ECO_CONF_REG register
 *  I2S ECO register
 */
#define LP_I2S_ECO_CONF_REG (DR_REG_LP_I2S_BASE + 0x7c)
/** LP_I2S_RDN_ENA : R/W; bitpos: [0]; default: 0;
 *  enable rdn counter bit
 */
#define LP_I2S_RDN_ENA    (BIT(0))
#define LP_I2S_RDN_ENA_M  (LP_I2S_RDN_ENA_V << LP_I2S_RDN_ENA_S)
#define LP_I2S_RDN_ENA_V  0x00000001U
#define LP_I2S_RDN_ENA_S  0
/** LP_I2S_RDN_RESULT : RO; bitpos: [1]; default: 0;
 *  rdn result
 */
#define LP_I2S_RDN_RESULT    (BIT(1))
#define LP_I2S_RDN_RESULT_M  (LP_I2S_RDN_RESULT_V << LP_I2S_RDN_RESULT_S)
#define LP_I2S_RDN_RESULT_V  0x00000001U
#define LP_I2S_RDN_RESULT_S  1

/** LP_I2S_VAD_PARAM0_REG register
 *  I2S VAD Parameter register
 */
#define LP_I2S_VAD_PARAM0_REG (DR_REG_LP_I2S_BASE + 0x80)
/** LP_I2S_PARAM_MIN_ENERGY : R/W; bitpos: [15:0]; default: 5000;
 *  VAD parameter
 */
#define LP_I2S_PARAM_MIN_ENERGY    0x0000FFFFU
#define LP_I2S_PARAM_MIN_ENERGY_M  (LP_I2S_PARAM_MIN_ENERGY_V << LP_I2S_PARAM_MIN_ENERGY_S)
#define LP_I2S_PARAM_MIN_ENERGY_V  0x0000FFFFU
#define LP_I2S_PARAM_MIN_ENERGY_S  0
/** LP_I2S_PARAM_INIT_FRAME_NUM : R/W; bitpos: [24:16]; default: 200;
 *  VAD parameter
 */
#define LP_I2S_PARAM_INIT_FRAME_NUM    0x000001FFU
#define LP_I2S_PARAM_INIT_FRAME_NUM_M  (LP_I2S_PARAM_INIT_FRAME_NUM_V << LP_I2S_PARAM_INIT_FRAME_NUM_S)
#define LP_I2S_PARAM_INIT_FRAME_NUM_V  0x000001FFU
#define LP_I2S_PARAM_INIT_FRAME_NUM_S  16

/** LP_I2S_VAD_PARAM1_REG register
 *  I2S VAD Parameter register
 */
#define LP_I2S_VAD_PARAM1_REG (DR_REG_LP_I2S_BASE + 0x84)
/** LP_I2S_PARAM_MIN_SPEECH_COUNT : R/W; bitpos: [3:0]; default: 3;
 *  VAD parameter
 */
#define LP_I2S_PARAM_MIN_SPEECH_COUNT    0x0000000FU
#define LP_I2S_PARAM_MIN_SPEECH_COUNT_M  (LP_I2S_PARAM_MIN_SPEECH_COUNT_V << LP_I2S_PARAM_MIN_SPEECH_COUNT_S)
#define LP_I2S_PARAM_MIN_SPEECH_COUNT_V  0x0000000FU
#define LP_I2S_PARAM_MIN_SPEECH_COUNT_S  0
/** LP_I2S_PARAM_MAX_SPEECH_COUNT : R/W; bitpos: [10:4]; default: 100;
 *  VAD parameter
 */
#define LP_I2S_PARAM_MAX_SPEECH_COUNT    0x0000007FU
#define LP_I2S_PARAM_MAX_SPEECH_COUNT_M  (LP_I2S_PARAM_MAX_SPEECH_COUNT_V << LP_I2S_PARAM_MAX_SPEECH_COUNT_S)
#define LP_I2S_PARAM_MAX_SPEECH_COUNT_V  0x0000007FU
#define LP_I2S_PARAM_MAX_SPEECH_COUNT_S  4
/** LP_I2S_PARAM_HANGOVER_SPEECH : R/W; bitpos: [15:11]; default: 3;
 *  VAD parameter
 */
#define LP_I2S_PARAM_HANGOVER_SPEECH    0x0000001FU
#define LP_I2S_PARAM_HANGOVER_SPEECH_M  (LP_I2S_PARAM_HANGOVER_SPEECH_V << LP_I2S_PARAM_HANGOVER_SPEECH_S)
#define LP_I2S_PARAM_HANGOVER_SPEECH_V  0x0000001FU
#define LP_I2S_PARAM_HANGOVER_SPEECH_S  11
/** LP_I2S_PARAM_HANGOVER_SILENT : R/W; bitpos: [23:16]; default: 30;
 *  VAD parameter
 */
#define LP_I2S_PARAM_HANGOVER_SILENT    0x000000FFU
#define LP_I2S_PARAM_HANGOVER_SILENT_M  (LP_I2S_PARAM_HANGOVER_SILENT_V << LP_I2S_PARAM_HANGOVER_SILENT_S)
#define LP_I2S_PARAM_HANGOVER_SILENT_V  0x000000FFU
#define LP_I2S_PARAM_HANGOVER_SILENT_S  16
/** LP_I2S_PARAM_MAX_OFFSET : R/W; bitpos: [30:24]; default: 40;
 *  VAD parameter
 */
#define LP_I2S_PARAM_MAX_OFFSET    0x0000007FU
#define LP_I2S_PARAM_MAX_OFFSET_M  (LP_I2S_PARAM_MAX_OFFSET_V << LP_I2S_PARAM_MAX_OFFSET_S)
#define LP_I2S_PARAM_MAX_OFFSET_V  0x0000007FU
#define LP_I2S_PARAM_MAX_OFFSET_S  24
/** LP_I2S_PARAM_SKIP_BAND_ENERGY : R/W; bitpos: [31]; default: 0;
 *  Set 1 to skip band energy check.
 */
#define LP_I2S_PARAM_SKIP_BAND_ENERGY    (BIT(31))
#define LP_I2S_PARAM_SKIP_BAND_ENERGY_M  (LP_I2S_PARAM_SKIP_BAND_ENERGY_V << LP_I2S_PARAM_SKIP_BAND_ENERGY_S)
#define LP_I2S_PARAM_SKIP_BAND_ENERGY_V  0x00000001U
#define LP_I2S_PARAM_SKIP_BAND_ENERGY_S  31

/** LP_I2S_VAD_PARAM2_REG register
 *  I2S VAD Parameter register
 */
#define LP_I2S_VAD_PARAM2_REG (DR_REG_LP_I2S_BASE + 0x88)
/** LP_I2S_PARAM_NOISE_AMP_DOWN : R/W; bitpos: [15:0]; default: 26214;
 *  VAD parameter
 */
#define LP_I2S_PARAM_NOISE_AMP_DOWN    0x0000FFFFU
#define LP_I2S_PARAM_NOISE_AMP_DOWN_M  (LP_I2S_PARAM_NOISE_AMP_DOWN_V << LP_I2S_PARAM_NOISE_AMP_DOWN_S)
#define LP_I2S_PARAM_NOISE_AMP_DOWN_V  0x0000FFFFU
#define LP_I2S_PARAM_NOISE_AMP_DOWN_S  0
/** LP_I2S_PARAM_NOISE_AMP_UP : R/W; bitpos: [31:16]; default: 32440;
 *  VAD parameter
 */
#define LP_I2S_PARAM_NOISE_AMP_UP    0x0000FFFFU
#define LP_I2S_PARAM_NOISE_AMP_UP_M  (LP_I2S_PARAM_NOISE_AMP_UP_V << LP_I2S_PARAM_NOISE_AMP_UP_S)
#define LP_I2S_PARAM_NOISE_AMP_UP_V  0x0000FFFFU
#define LP_I2S_PARAM_NOISE_AMP_UP_S  16

/** LP_I2S_VAD_PARAM3_REG register
 *  I2S VAD Parameter register
 */
#define LP_I2S_VAD_PARAM3_REG (DR_REG_LP_I2S_BASE + 0x8c)
/** LP_I2S_PARAM_NOISE_SPE_UP0 : R/W; bitpos: [15:0]; default: 32735;
 *  VAD parameter
 */
#define LP_I2S_PARAM_NOISE_SPE_UP0    0x0000FFFFU
#define LP_I2S_PARAM_NOISE_SPE_UP0_M  (LP_I2S_PARAM_NOISE_SPE_UP0_V << LP_I2S_PARAM_NOISE_SPE_UP0_S)
#define LP_I2S_PARAM_NOISE_SPE_UP0_V  0x0000FFFFU
#define LP_I2S_PARAM_NOISE_SPE_UP0_S  0
/** LP_I2S_PARAM_NOISE_SPE_UP1 : R/W; bitpos: [31:16]; default: 32113;
 *  VAD parameter
 */
#define LP_I2S_PARAM_NOISE_SPE_UP1    0x0000FFFFU
#define LP_I2S_PARAM_NOISE_SPE_UP1_M  (LP_I2S_PARAM_NOISE_SPE_UP1_V << LP_I2S_PARAM_NOISE_SPE_UP1_S)
#define LP_I2S_PARAM_NOISE_SPE_UP1_V  0x0000FFFFU
#define LP_I2S_PARAM_NOISE_SPE_UP1_S  16

/** LP_I2S_VAD_PARAM4_REG register
 *  I2S VAD Parameter register
 */
#define LP_I2S_VAD_PARAM4_REG (DR_REG_LP_I2S_BASE + 0x90)
/** LP_I2S_PARAM_NOISE_SPE_DOWN : R/W; bitpos: [15:0]; default: 26214;
 *  VAD parameter
 */
#define LP_I2S_PARAM_NOISE_SPE_DOWN    0x0000FFFFU
#define LP_I2S_PARAM_NOISE_SPE_DOWN_M  (LP_I2S_PARAM_NOISE_SPE_DOWN_V << LP_I2S_PARAM_NOISE_SPE_DOWN_S)
#define LP_I2S_PARAM_NOISE_SPE_DOWN_V  0x0000FFFFU
#define LP_I2S_PARAM_NOISE_SPE_DOWN_S  0
/** LP_I2S_PARAM_NOISE_MEAN_DOWN : R/W; bitpos: [31:16]; default: 31130;
 *  VAD parameter
 */
#define LP_I2S_PARAM_NOISE_MEAN_DOWN    0x0000FFFFU
#define LP_I2S_PARAM_NOISE_MEAN_DOWN_M  (LP_I2S_PARAM_NOISE_MEAN_DOWN_V << LP_I2S_PARAM_NOISE_MEAN_DOWN_S)
#define LP_I2S_PARAM_NOISE_MEAN_DOWN_V  0x0000FFFFU
#define LP_I2S_PARAM_NOISE_MEAN_DOWN_S  16

/** LP_I2S_VAD_PARAM5_REG register
 *  I2S VAD Parameter register
 */
#define LP_I2S_VAD_PARAM5_REG (DR_REG_LP_I2S_BASE + 0x94)
/** LP_I2S_PARAM_NOISE_MEAN_UP0 : R/W; bitpos: [15:0]; default: 32113;
 *  VAD parameter
 */
#define LP_I2S_PARAM_NOISE_MEAN_UP0    0x0000FFFFU
#define LP_I2S_PARAM_NOISE_MEAN_UP0_M  (LP_I2S_PARAM_NOISE_MEAN_UP0_V << LP_I2S_PARAM_NOISE_MEAN_UP0_S)
#define LP_I2S_PARAM_NOISE_MEAN_UP0_V  0x0000FFFFU
#define LP_I2S_PARAM_NOISE_MEAN_UP0_S  0
/** LP_I2S_PARAM_NOISE_MEAN_UP1 : R/W; bitpos: [31:16]; default: 31784;
 *  VAD parameter
 */
#define LP_I2S_PARAM_NOISE_MEAN_UP1    0x0000FFFFU
#define LP_I2S_PARAM_NOISE_MEAN_UP1_M  (LP_I2S_PARAM_NOISE_MEAN_UP1_V << LP_I2S_PARAM_NOISE_MEAN_UP1_S)
#define LP_I2S_PARAM_NOISE_MEAN_UP1_V  0x0000FFFFU
#define LP_I2S_PARAM_NOISE_MEAN_UP1_S  16

/** LP_I2S_VAD_PARAM6_REG register
 *  I2S VAD Parameter register
 */
#define LP_I2S_VAD_PARAM6_REG (DR_REG_LP_I2S_BASE + 0x98)
/** LP_I2S_PARAM_NOISE_STD_FS_THSL : R/W; bitpos: [15:0]; default: 32000;
 *  Feature_sum threshold to determine noise_std max value when vad_tag=1, equal to
 *  ((noise_std_max)>>11)^2*5
 */
#define LP_I2S_PARAM_NOISE_STD_FS_THSL    0x0000FFFFU
#define LP_I2S_PARAM_NOISE_STD_FS_THSL_M  (LP_I2S_PARAM_NOISE_STD_FS_THSL_V << LP_I2S_PARAM_NOISE_STD_FS_THSL_S)
#define LP_I2S_PARAM_NOISE_STD_FS_THSL_V  0x0000FFFFU
#define LP_I2S_PARAM_NOISE_STD_FS_THSL_S  0
/** LP_I2S_PARAM_NOISE_STD_FS_THSH : R/W; bitpos: [31:16]; default: 46080;
 *  Feature_sum threshold to determine noise_std max value when vad_tag=0, equal to
 *  ((noise_std_max)>>11)^2*5
 */
#define LP_I2S_PARAM_NOISE_STD_FS_THSH    0x0000FFFFU
#define LP_I2S_PARAM_NOISE_STD_FS_THSH_M  (LP_I2S_PARAM_NOISE_STD_FS_THSH_V << LP_I2S_PARAM_NOISE_STD_FS_THSH_S)
#define LP_I2S_PARAM_NOISE_STD_FS_THSH_V  0x0000FFFFU
#define LP_I2S_PARAM_NOISE_STD_FS_THSH_S  16

