espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/lp_i2s_reg.h
/** LP_I2S_VAD_PARAM7_REG register
 *  I2S VAD Parameter register
 */
#define LP_I2S_VAD_PARAM7_REG (DR_REG_LP_I2S_BASE + 0x9c)
/** LP_I2S_PARAM_THRES_UPD_BASE : R/W; bitpos: [15:0]; default: 32440;
 *  VAD parameter
 */
#define LP_I2S_PARAM_THRES_UPD_BASE    0x0000FFFFU
#define LP_I2S_PARAM_THRES_UPD_BASE_M  (LP_I2S_PARAM_THRES_UPD_BASE_V << LP_I2S_PARAM_THRES_UPD_BASE_S)
#define LP_I2S_PARAM_THRES_UPD_BASE_V  0x0000FFFFU
#define LP_I2S_PARAM_THRES_UPD_BASE_S  0
/** LP_I2S_PARAM_THRES_UPD_VARY : R/W; bitpos: [31:16]; default: 328;
 *  VAD parameter
 */
#define LP_I2S_PARAM_THRES_UPD_VARY    0x0000FFFFU
#define LP_I2S_PARAM_THRES_UPD_VARY_M  (LP_I2S_PARAM_THRES_UPD_VARY_V << LP_I2S_PARAM_THRES_UPD_VARY_S)
#define LP_I2S_PARAM_THRES_UPD_VARY_V  0x0000FFFFU
#define LP_I2S_PARAM_THRES_UPD_VARY_S  16

/** LP_I2S_VAD_PARAM8_REG register
 *  I2S VAD Parameter register
 */
#define LP_I2S_VAD_PARAM8_REG (DR_REG_LP_I2S_BASE + 0xa0)
/** LP_I2S_PARAM_THRES_UPD_BDL : R/W; bitpos: [7:0]; default: 64;
 *  Noise_std boundary low when updating threshold.
 */
#define LP_I2S_PARAM_THRES_UPD_BDL    0x000000FFU
#define LP_I2S_PARAM_THRES_UPD_BDL_M  (LP_I2S_PARAM_THRES_UPD_BDL_V << LP_I2S_PARAM_THRES_UPD_BDL_S)
#define LP_I2S_PARAM_THRES_UPD_BDL_V  0x000000FFU
#define LP_I2S_PARAM_THRES_UPD_BDL_S  0
/** LP_I2S_PARAM_THRES_UPD_BDH : R/W; bitpos: [15:8]; default: 80;
 *  Noise_std boundary high when updating threshold.
 */
#define LP_I2S_PARAM_THRES_UPD_BDH    0x000000FFU
#define LP_I2S_PARAM_THRES_UPD_BDH_M  (LP_I2S_PARAM_THRES_UPD_BDH_V << LP_I2S_PARAM_THRES_UPD_BDH_S)
#define LP_I2S_PARAM_THRES_UPD_BDH_V  0x000000FFU
#define LP_I2S_PARAM_THRES_UPD_BDH_S  8
/** LP_I2S_PARAM_FEATURE_BURST : R/W; bitpos: [31:16]; default: 8192;
 *  VAD parameter
 */
#define LP_I2S_PARAM_FEATURE_BURST    0x0000FFFFU
#define LP_I2S_PARAM_FEATURE_BURST_M  (LP_I2S_PARAM_FEATURE_BURST_V << LP_I2S_PARAM_FEATURE_BURST_S)
#define LP_I2S_PARAM_FEATURE_BURST_V  0x0000FFFFU
#define LP_I2S_PARAM_FEATURE_BURST_S  16

/** LP_I2S_VAD_OB0_REG register
 *  I2S VAD Observe register
 */
#define LP_I2S_VAD_OB0_REG (DR_REG_LP_I2S_BASE + 0xb0)
/** LP_I2S_SPEECH_COUNT_OB : RO; bitpos: [7:0]; default: 0;
 *  Reg silent count observe
 */
#define LP_I2S_SPEECH_COUNT_OB    0x000000FFU
#define LP_I2S_SPEECH_COUNT_OB_M  (LP_I2S_SPEECH_COUNT_OB_V << LP_I2S_SPEECH_COUNT_OB_S)
#define LP_I2S_SPEECH_COUNT_OB_V  0x000000FFU
#define LP_I2S_SPEECH_COUNT_OB_S  0
/** LP_I2S_SILENT_COUNT_OB : RO; bitpos: [15:8]; default: 0;
 *  Reg speech count observe
 */
#define LP_I2S_SILENT_COUNT_OB    0x000000FFU
#define LP_I2S_SILENT_COUNT_OB_M  (LP_I2S_SILENT_COUNT_OB_V << LP_I2S_SILENT_COUNT_OB_S)
#define LP_I2S_SILENT_COUNT_OB_V  0x000000FFU
#define LP_I2S_SILENT_COUNT_OB_S  8
/** LP_I2S_MAX_SIGNAL0_OB : RO; bitpos: [31:16]; default: 0;
 *  Reg max signal0 observe
 */
#define LP_I2S_MAX_SIGNAL0_OB    0x0000FFFFU
#define LP_I2S_MAX_SIGNAL0_OB_M  (LP_I2S_MAX_SIGNAL0_OB_V << LP_I2S_MAX_SIGNAL0_OB_S)
#define LP_I2S_MAX_SIGNAL0_OB_V  0x0000FFFFU
#define LP_I2S_MAX_SIGNAL0_OB_S  16

/** LP_I2S_VAD_OB1_REG register
 *  I2S VAD Observe register
 */
#define LP_I2S_VAD_OB1_REG (DR_REG_LP_I2S_BASE + 0xb4)
/** LP_I2S_MAX_SIGNAL1_OB : RO; bitpos: [15:0]; default: 0;
 *  Reg max signal1 observe
 */
#define LP_I2S_MAX_SIGNAL1_OB    0x0000FFFFU
#define LP_I2S_MAX_SIGNAL1_OB_M  (LP_I2S_MAX_SIGNAL1_OB_V << LP_I2S_MAX_SIGNAL1_OB_S)
#define LP_I2S_MAX_SIGNAL1_OB_V  0x0000FFFFU
#define LP_I2S_MAX_SIGNAL1_OB_S  0
/** LP_I2S_MAX_SIGNAL2_OB : RO; bitpos: [31:16]; default: 0;
 *  Reg max signal2 observe
 */
#define LP_I2S_MAX_SIGNAL2_OB    0x0000FFFFU
#define LP_I2S_MAX_SIGNAL2_OB_M  (LP_I2S_MAX_SIGNAL2_OB_V << LP_I2S_MAX_SIGNAL2_OB_S)
#define LP_I2S_MAX_SIGNAL2_OB_V  0x0000FFFFU
#define LP_I2S_MAX_SIGNAL2_OB_S  16

/** LP_I2S_VAD_OB2_REG register
 *  I2S VAD Observe register
 */
#define LP_I2S_VAD_OB2_REG (DR_REG_LP_I2S_BASE + 0xb8)
/** LP_I2S_NOISE_AMP_OB : RO; bitpos: [31:0]; default: 0;
 *  Reg noise_amp observe signal
 */
#define LP_I2S_NOISE_AMP_OB    0xFFFFFFFFU
#define LP_I2S_NOISE_AMP_OB_M  (LP_I2S_NOISE_AMP_OB_V << LP_I2S_NOISE_AMP_OB_S)
#define LP_I2S_NOISE_AMP_OB_V  0xFFFFFFFFU
#define LP_I2S_NOISE_AMP_OB_S  0

/** LP_I2S_VAD_OB3_REG register
 *  I2S VAD Observe register
 */
#define LP_I2S_VAD_OB3_REG (DR_REG_LP_I2S_BASE + 0xbc)
/** LP_I2S_NOISE_MEAN_OB : RO; bitpos: [31:0]; default: 0;
 *  Reg noise_mean observe signal
 */
#define LP_I2S_NOISE_MEAN_OB    0xFFFFFFFFU
#define LP_I2S_NOISE_MEAN_OB_M  (LP_I2S_NOISE_MEAN_OB_V << LP_I2S_NOISE_MEAN_OB_S)
#define LP_I2S_NOISE_MEAN_OB_V  0xFFFFFFFFU
#define LP_I2S_NOISE_MEAN_OB_S  0

/** LP_I2S_VAD_OB4_REG register
 *  I2S VAD Observe register
 */
#define LP_I2S_VAD_OB4_REG (DR_REG_LP_I2S_BASE + 0xc0)
/** LP_I2S_NOISE_STD_OB : RO; bitpos: [31:0]; default: 0;
 *  Reg noise_std observe signal
 */
#define LP_I2S_NOISE_STD_OB    0xFFFFFFFFU
#define LP_I2S_NOISE_STD_OB_M  (LP_I2S_NOISE_STD_OB_V << LP_I2S_NOISE_STD_OB_S)
#define LP_I2S_NOISE_STD_OB_V  0xFFFFFFFFU
#define LP_I2S_NOISE_STD_OB_S  0

/** LP_I2S_VAD_OB5_REG register
 *  I2S VAD Observe register
 */
#define LP_I2S_VAD_OB5_REG (DR_REG_LP_I2S_BASE + 0xc4)
/** LP_I2S_OFFSET_OB : RO; bitpos: [31:0]; default: 0;
 *  Reg offset observe signal
 */
#define LP_I2S_OFFSET_OB    0xFFFFFFFFU
#define LP_I2S_OFFSET_OB_M  (LP_I2S_OFFSET_OB_V << LP_I2S_OFFSET_OB_S)
#define LP_I2S_OFFSET_OB_V  0xFFFFFFFFU
#define LP_I2S_OFFSET_OB_S  0

/** LP_I2S_VAD_OB6_REG register
 *  I2S VAD Observe register
 */
#define LP_I2S_VAD_OB6_REG (DR_REG_LP_I2S_BASE + 0xc8)
/** LP_I2S_THRESHOLD_OB : RO; bitpos: [31:0]; default: 0;
 *  Reg threshold observe signal
 */
#define LP_I2S_THRESHOLD_OB    0xFFFFFFFFU
#define LP_I2S_THRESHOLD_OB_M  (LP_I2S_THRESHOLD_OB_V << LP_I2S_THRESHOLD_OB_S)
#define LP_I2S_THRESHOLD_OB_V  0xFFFFFFFFU
#define LP_I2S_THRESHOLD_OB_S  0

/** LP_I2S_VAD_OB7_REG register
 *  I2S VAD Observe register
 */
#define LP_I2S_VAD_OB7_REG (DR_REG_LP_I2S_BASE + 0xcc)
/** LP_I2S_ENERGY_LOW_OB : RO; bitpos: [31:0]; default: 0;
 *  Reg energy bit 31~0 observe signal
 */
#define LP_I2S_ENERGY_LOW_OB    0xFFFFFFFFU
#define LP_I2S_ENERGY_LOW_OB_M  (LP_I2S_ENERGY_LOW_OB_V << LP_I2S_ENERGY_LOW_OB_S)
#define LP_I2S_ENERGY_LOW_OB_V  0xFFFFFFFFU
#define LP_I2S_ENERGY_LOW_OB_S  0

