espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/lp_i2s_reg.h
/** LP_I2S_VAD_OB8_REG register
 *  I2S VAD Observe register
 */
#define LP_I2S_VAD_OB8_REG (DR_REG_LP_I2S_BASE + 0xd0)
/** LP_I2S_ENERGY_HIGH_OB : RO; bitpos: [31:0]; default: 0;
 *  Reg energy bit 63~32 observe signal
 */
#define LP_I2S_ENERGY_HIGH_OB    0xFFFFFFFFU
#define LP_I2S_ENERGY_HIGH_OB_M  (LP_I2S_ENERGY_HIGH_OB_V << LP_I2S_ENERGY_HIGH_OB_S)
#define LP_I2S_ENERGY_HIGH_OB_V  0xFFFFFFFFU
#define LP_I2S_ENERGY_HIGH_OB_S  0

/** LP_I2S_CLK_GATE_REG register
 *  Clock gate register
 */
#define LP_I2S_CLK_GATE_REG (DR_REG_LP_I2S_BASE + 0xf8)
/** LP_I2S_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  set this bit to enable clock gate
 */
#define LP_I2S_CLK_EN    (BIT(0))
#define LP_I2S_CLK_EN_M  (LP_I2S_CLK_EN_V << LP_I2S_CLK_EN_S)
#define LP_I2S_CLK_EN_V  0x00000001U
#define LP_I2S_CLK_EN_S  0
/** LP_I2S_VAD_CG_FORCE_ON : R/W; bitpos: [1]; default: 1;
 *  VAD clock gate force on register
 */
#define LP_I2S_VAD_CG_FORCE_ON    (BIT(1))
#define LP_I2S_VAD_CG_FORCE_ON_M  (LP_I2S_VAD_CG_FORCE_ON_V << LP_I2S_VAD_CG_FORCE_ON_S)
#define LP_I2S_VAD_CG_FORCE_ON_V  0x00000001U
#define LP_I2S_VAD_CG_FORCE_ON_S  1
/** LP_I2S_RX_MEM_CG_FORCE_ON : R/W; bitpos: [2]; default: 0;
 *  I2S rx mem clock gate force on register
 */
#define LP_I2S_RX_MEM_CG_FORCE_ON    (BIT(2))
#define LP_I2S_RX_MEM_CG_FORCE_ON_M  (LP_I2S_RX_MEM_CG_FORCE_ON_V << LP_I2S_RX_MEM_CG_FORCE_ON_S)
#define LP_I2S_RX_MEM_CG_FORCE_ON_V  0x00000001U
#define LP_I2S_RX_MEM_CG_FORCE_ON_S  2
/** LP_I2S_RX_REG_CG_FORCE_ON : R/W; bitpos: [3]; default: 1;
 *  I2S rx reg clock gate force on register
 */
#define LP_I2S_RX_REG_CG_FORCE_ON    (BIT(3))
#define LP_I2S_RX_REG_CG_FORCE_ON_M  (LP_I2S_RX_REG_CG_FORCE_ON_V << LP_I2S_RX_REG_CG_FORCE_ON_S)
#define LP_I2S_RX_REG_CG_FORCE_ON_V  0x00000001U
#define LP_I2S_RX_REG_CG_FORCE_ON_S  3

/** LP_I2S_DATE_REG register
 *  Version control register
 */
#define LP_I2S_DATE_REG (DR_REG_LP_I2S_BASE + 0xfc)
/** LP_I2S_DATE : R/W; bitpos: [27:0]; default: 36720704;
 *  I2S version control register
 */
#define LP_I2S_DATE    0x0FFFFFFFU
#define LP_I2S_DATE_M  (LP_I2S_DATE_V << LP_I2S_DATE_S)
#define LP_I2S_DATE_V  0x0FFFFFFFU
#define LP_I2S_DATE_S  0

#ifdef __cplusplus
}
#endif
